[
  {
    "header_image_url": "https://i.redd.it/8w6uy60q98671.png",
    "header_title": "Hermitcraft Season 8 Launch!",
    "header_description": "What can we expect from this instalment of Hermits building mega bases and playing silly minigames?",
    "article_url": "html/article.html?name=Hermitcraft%20Season%208%20Launch!",
    "sections": [
      {
        "subheader": "Building Closeness!",
        "paragraphs": [
          "Several Hermits have expressed their wanting to make their main builds closer together in Hermitcraft 8 than in previous seasons. We've never really seen a \"close\" season in terms of Hermit proximity since season 6 I feel. The opportunity to do that exact thing in Season 8 will not only fullfill their yearning but also bring a little bit of relatability for us viewers, or at least in my perspective, since I expect that most of us Minecraft players build in close proximity to each other, if not even sharing bases. So it's great to know that we're getting a season that could give us more of those \"this hits close to home\" vibes."
        ]
      },
      {
        "subheader": "Realistic Project Scopes?",
        "paragraphs": [
          "The Omega tree was far from complete when Hermitcraft 7 came to a close and the Barge's version of the HCBBS has only been opened for how long - one week before the season comes to an end!? Those are just two uncompleted or barely utilized projects I can recall in a snap - there's probably a bunch more that needs a bit of YouTube video re-binging for me to remember. I don't think any Hermits have explicitly said that they were aiming for projects that are actually completable in a season THIS season, so this is just a speculation - though a speculation that I feel will proof itself correct as the season unfolds. This ties in well with my point above - the hermits may be looking to offer us a more relatable experience and perhaps main base proximity is just one way, and realistic prjects that we're able to replicate or emulate (not as in exactly copying their builds block for block, come on - you know what I mean) if we really wanted to may well be the second way."
        ]
      },
      {
        "subheader": "Voice Chat Banter!",
        "paragraphs": [
          "The proximity voice chat mod (which seems to be Simple Voice Chat by henkelmax which you can find over at CurseForge, correct me if I'm wrong) has been in play since the later parts of season 7, but we've only seen its full banter potential in the short-lived series Third Life. Since the Hermits will live quite close to each other this season, this mod should play a major role in many important and defining moments of season 8, probably for a comedic reason. I know, I'm hyping up what literally is just a simple voice chat mod, but really guys, you aren't excited about this feature!?"
        ]
      },
      {
        "subheader": "Want the Coverage?",
        "paragraphs": [
          "If you want to check out videos of Hermitcraft 8 I highly recommend using Hypno's site at --> hermitcraft.com <-- as your up-to-date content feed. Especially if you want to find out more about members that don't arrive in your YouTube recommendations because they don't have a gazillion subscribers like the big boys. Seriously. There are a number of underrated players featuring in Hermitcraft 8, or any season, really."
        ]
      }
    ]
  }
]
